app/controllers/cours_controller.rb

SELECT "cours".* FROM "cours"
---
  def index
    @cours = Cour.all

INSERT INTO "cours" ("titre", "niveau", "filiere", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["titre", "Maths"], ["niveau", "Bac+3"], ["filiere", "MA"], ["description", "testtesteytsiud"], ["created_at", "2015-11-23 18:07:45.840211"], ["updated_at", "2015-11-23 18:07:45.840211"]]
---
  def create
    @cour = current_user.cours.build(cour_params)

    respond_to do |format|
      if @cour.save

UPDATE "cours" SET "niveau" = ?, "filiere" = ?, "updated_at" = ? WHERE "cours"."id" = ?  [["niveau", "BAC+2"], ["filiere", "Eco"], ["updated_at", "2015-11-24 23:40:52.354663"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @cour.update(cour_params)

DELETE FROM "cours" WHERE "cours"."id" = ?  [["id", 1]]
---
  def destroy
    @cour.destroy

SELECT  "cours".* FROM "cours" WHERE "cours"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_cour
      @cour = Cour.find(params[:id])